# IdeaStatiCa.ConnectionApi.Model.ConnectionData

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ConnectionPoint** | **ReferenceElement** |  | [optional]
**Beams** | **List&lt;BeamData&gt;** |  | [optional]
**Plates** | **List&lt;PlateData&gt;** |  | [optional]
**FoldedPlates** | **List&lt;FoldedPlateData&gt;** |  | [optional]
**BoltGrids** | **List&lt;BoltGrid&gt;** |  | [optional]
**AnchorGrids** | **List&lt;AnchorGrid&gt;** |  | [optional]
**PinGrids** | **List&lt;PinGrid&gt;** |  | [optional]
**Welds** | **List&lt;WeldData&gt;** |  | [optional]
**ConcreteBlocks** | **List&lt;ConcreteBlockData&gt;** |  | [optional]
**CutBeamByBeams** | **List&lt;CutBeamByBeamData&gt;** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)